Repository: theartcher/freazy
Catalog: lib/l10n/app_*.arb
Languages: nl

# homePage_searchBar_searching
source: Search...
nl: Zoeken...

# homePage_items_noItemsFound
source: No products found.
nl: Geen producten gevonden.

# homePage_searchBar_sortItemsAlphabetically
source: Alphabetically
nl: Alfabetisch

# homePage_searchBar_sortToExpireFirst
source: Expiration date
nl: Houdbaarheidsdatum

# homePage_searchBar_sortCategoryAlphabetically
source: Categories
nl: Alfabetisch

# homePage_searchBar_sortFreezerAlphabetically
source: Freezers
nl: Vriezers

# homePage_item_deletedItem
source: Deleted {item}.
nl: {item} verwijderd.

# homePage_item_undoDeleteItem
source: Undo deletion
nl: Ongedaan

# homePage_item_description
source: Expiry date: {date} Location: {freezer} Category: {category}
nl: Houdbaarheidsdatum: {date} Locatie: {freezer} Categorie: {category}

# homePage_item_expiredAttribute
source: [EXPIRED]
nl: [OVER DATUM]

# settingsPage_header_title
source: Settings
nl: Instellingen

# settingsPage_remindersSection_header
source: Notifications & Reminders
nl: Herinnerringen & meldingen

# settingsPage_remindersSection_notificationTitle
source: Receive notifications
nl: Meldingen ontvangen

# settingsPage_remindersSection_notificationDescription
source: Get notifications when products are about to expire.
nl: Kies of je meldingen wilt ontvangen met betrekking tot producten.

# settingsPage_remindersSection_remindersTitle
source: Manage reminders
nl: Herinerringen aanpassen

# settingsPage_remindersSection_remindersDescription
source: Configure when you'll receive notifications.
nl: Kies wanneer je herinnert wordt aan een product.

# settingsPage_remindersSection_reminderTimeTitle
source: Select preferred time
nl: Herinnering's tijd

# settingsPage_remindersSection_reminderTimeDescription
source: Choose the time you prefer to receive your reminders.
nl: Kies wanneer hoe laat je herinnert wilt worden.

# settingsPage_personalizationSection_header
source: Personalization
nl: Personalisatie

# settingsPage_personalizationSection_themeTitle
source: Select a theme
nl: Thema

# settingsPage_personalizationSection_themeDescription
source: Change the app's appearance
nl: Kies het uiterlijk van de app.

# settingsPage_personalizationSection_themeLight
source: Light
nl: Licht

# settingsPage_personalizationSection_themeDark
source: Dark
nl: Donker

# settingsPage_personalizationSection_themeSystem
source: System
nl: Systeem

# settingsPage_personalizationSection_localeTitle
source: Language
nl: Taal

# settingsPage_personalizationSection_localeDescription
source: Select your preferred language.
nl: Selecteer de gebruikte taal, beïnvloed ook tijd en datums.

# settingsPage_personalizationSection_localeEN
source: English
nl: Engels

# settingsPage_personalizationSection_localeNL
source: Dutch
nl: Nederlands

# settingsPage_resetApp_confirmationTitle
source: Are you sure you wish to reset the entire app?
nl: Weet je het zeker?

# settingsPage_resetApp_confirmationContext
source: This action cannot be undone. This will completely remove all products, settings, and other preferences.
nl: Deze actie kan niet ongedaan worden gemaakt. Dit verwijderd al uw producten, instellingen en andere voorkeuren.

# settingsPage_resetApp_checkboxAcceptConsequences
source: I understand and accept the consequences of resetting
nl: Ik begrijp de gevolgen van deze actie.

# settingsPage_exportImportSection_header
source: Backup & Restore
nl: Backup & herstel

# settingsPage_exportDatabase_exportDatabaseTitle
source: Export backup
nl: Exporteer backup

# settingsPage_exportDatabase_exportDatabaseDescription
source: Export your database to a file.
nl: Exporteer je producten naar een bestand.

# settingsPage_exportDatabase_exportDatabaseSuccess
source: Export successful.
nl: Producten succesvol geëxporteerd.

# settingsPage_exportDatabase_exportDatabaseCancelled
source: The export was cancelled.
nl: Producten exporteren geannuleerd.

# settingsPage_exportDatabase_exportNoItems
source: You have no items to export.
nl: Er zijn geen producten om te exporteren.

# settingsPage_exportDatabase_exportStoragePermissionRequired
source: Storage permission required to export your items
nl: Toegang tot de opslag is vereist om je producten te exporteren.

# settingsPage_exportDatabase_exportUnknownError
source: An unknown error occurred during the export...
nl: Er is een onbekende fout opgetreden tijdens het exporteren van de backup.

# settingsPage_exportDatabase_importDatabaseSuccess
source: Import successful.
nl: Producten succesvol geïmporteerd.

# settingsPage_exportDatabase_importDatabaseCancelled
source: The import was cancelled.
nl: Producten import geannuleerd.

# settingsPage_exportDatabase_importNoItems
source: No items found in the backup file.
nl: Er zijn geen producten om te importeren.

# settingsPage_exportDatabase_importStoragePermissionRequired
source: Storage permission is required to import your items
nl: Toegang tot de opslag is vereist om je producten te importeren.

# settingsPage_exportDatabase_importUnknownError
source: An unknown error occurred during the import...
nl: Er is een onbekende fout opgetreden tijdens het importeren van de backup.

# settingsPage_importDatabase_dialogueTitle
source: Configure import
nl: Import configureren

# settingsPage_importDatabase_dialogueDescription
source: Would you like to clear existing items before importing?
nl: Wil je bestaande producten bewaren naast de geïmporteerde producten?

# settingsPage_importDatabase_dialogueRemoveExistingItems
source: Clear existing items
nl: Verwijder bestaande producten

# settingsPage_importDatabase_dialogueImportConfirmation
source: Import
nl: Importeer

# settingsPage_importDatabase_importDatabaseTitle
source: Import backup
nl: Importeer backup

# settingsPage_importDatabase_importDatabaseDescription
source: Import a database from a file.
nl: Importeer een database vanuit een bestand.

# configureRemindersPage_header_title
source: Configure reminders
nl: Configureer herinnerringen

# configureRemindersPage_section_title
source: Add new reminder
nl: Voeg herinnerring toe

# configureRemindersPage_reminder_prefix
source: Remind me in
nl: Herinner mij

# configureRemindersPage_reminder_optionDay
source: day(s)
nl: dag(-en)

# configureRemindersPage_reminder_optionWeek
source: week(s)
nl: week(-en)

# configureRemindersPage_reminderValidation_duplicate
source: The "{reminderAmount} - {reminderType}" reminder already exists.
nl: De melding "{reminderAmount} - {reminderType}" bestaat al.

# configureRemindersPage_reminder_noActiveReminders
source: You have no active reminders.
nl: U heeft geen opgeslagen herinnerringen

# itemConfig_generic_weighTitle
source: Weight
nl: Gewicht

# itemConfig_generic_weightUnitTitle
source: Unit
nl: Eenheid

# itemConfig_generic_freezerTitle
source: Freezer
nl: Vriezer

# itemConfig_generic_categoriesTitle
source: Category
nl: Categorie

# itemConfig_generic_freezeDateTitle
source: Freeze-in date
nl: Invries datum

# itemConfig_generic_expirationDateTitle
source: Expiration date
nl: Houdbaarheidsdatum

# itemConfig_edit_headerTitle
source: Edit product
nl: Product bewerken

# itemConfig_create_headerTitle
source: Add product
nl: Product toevoegen

# generic_cancel
source: Cancel
nl: Annuleren

# generic_confirm
source: Confirm
nl: Bevestigen

# generic_delete
source: Delete
nl: Verwijderen

# generic_dismiss
source: Dismiss
nl: Sluiten

# generic_undo
source: Undo
nl: Ongedaan maken
